Autodesk.Revit.DB.View.IsCategoryOverridable(Autodesk.Revit.DB.ElementId)
Checks whether the category can have graphic overrides in this view.
categoryId:
ElementId of the category.
Returns:
True if category can be overridden, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.IsValidViewTemplate(Autodesk.Revit.DB.ElementId)
Verify that %templateId% can be view template for this view:
it can be invalidElementId or represent template view that is compatible with this view
templateId:
Id to be validated as view template.
Returns:
True if %templateId% is valid as view template, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.ApplyViewTemplateParameters(Autodesk.Revit.DB.View)
Applies to this view the parameters of %otherView% that are not controlled by the current view template.
Remarks:
To get all template parameters call template's method getTemplateParameterIds.
To get parameters that are not controlled by the template call template's method getNonControlledTemplateParameterIds.
To get current view template use property ViewTemplateId.
otherView:
View whose parameters are to be applied to this view.
It does not have to be a valid template (property IsTemplate can be true or false).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.IsolateCategoriesTemporary(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Set categories to be temporarily isolated in the view.
elementIds:
Ids of categories to be isolated.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Some elements in elementIds do not correspond to a Category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.IsolateElementsTemporary(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Set multiple elements to be temporarily isolated in the view.
elementIds:
Ids of elements to be isolated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.HideCategoriesTemporary(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Set multiple categories to be temporarily hidden in the view.
elementIds:
Ids of the categories to be hidden
Throws Autodesk.Revit.Exceptions.ArgumentException:
Some elements in elementIds do not correspond to a Category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.HideElementsTemporary(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Set multiple elements to be temporarily hidden in the view.
elementIdSet:
Ids of the elements to be temporarily hidden.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.CanViewBeDuplicated(Autodesk.Revit.DB.ViewDuplicateOption)
Checks if the view can be duplicated
duplicateOption:
The manner in which the view will be duplicated
Returns:
True if the view can be duplicated
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.View.Duplicate(Autodesk.Revit.DB.ViewDuplicateOption)
Duplicates the view
Returns:
The id of the newly created view
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be duplicated
Since:
2013

Autodesk.Revit.DB.View.SetNonControlledTemplateParameterIds(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Set the parameters that will NOT be applied when this view is used as a template.
This should be a subset of the parameters returned by getTemplateParameterIds (other parameters will be ignored).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.GetNonControlledTemplateParameterIds
Returns list of parameters that will NOT be controlled when this view is used as a template.
This is a subset of the parameters returned by getTemplateParameterIds.
Since:
2013

Autodesk.Revit.DB.View.GetTemplateParameterIds
Returns list of parameters that may be controlled when this view is used as a template.
Since:
2013

Autodesk.Revit.DB.View.SilhouetteLineStyleId
Id of line style in used to draw silhouettes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This view does not contain display-related properties.
Since:
2014

Autodesk.Revit.DB.View.ShowSilhouettes
Indicates whether analytical surface silhouettes are calculated and shown.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This view does not contain display-related properties.
Since:
2014

Autodesk.Revit.DB.View.ShowEdges
Indicates whether the edges are visible or not.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This view does not contain display-related properties.
Since:
2014

Autodesk.Revit.DB.View.SurfaceTransparency
The amount of transparency applied to all surfaces.  0 = opaque, 100 = fully transparent.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value is invalid. The valid range is 0 through 100
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This view does not contain display-related properties.
Since:
2014

Autodesk.Revit.DB.View.ViewTemplateId
Id of template that controls view parameters.
Remarks:
Parameters controlled by the template cannot be changed directly in this view.
Any change to controlled parameters in the template will cause change of the corresponding parameters in this view.
To get all template parameters call template's method getTemplateParameterIds.
To get parameters that are not controlled by the template call template's method getNonControlledTemplateParameterIds.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: val is not valid as view template id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.UnhideElements(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Sets the elements to be shown in the given view if they are currently hidden.
elementIdSet: A set of ElementIds to be unhidden.
Remarks: This change is permanent until the elements are hidden again.
All elements in the set must be currently hidden.
An application can check this with Autodesk.Revit.DB.Element.IsHidden(Autodesk.Revit.DB.View).
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the set of elements to be unhidden is empty or one of the elements can not be unhidden.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when document regeneration failed.

Autodesk.Revit.DB.View.HideElements(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Sets the elements to be hidden in the view.
elementIdSet: A set of ElementIds to be hidden.
Remarks: This change is permanent until the elements are unhidden.
All elements in the set must be currently unhidden and must be allowed to be hidden.
An application can check this with Autodesk.Revit.DB.Element.IsHidden(Autodesk.Revit.DB.View) and Autodesk.Revit.DB.Element.CanBeHidden(Autodesk.Revit.DB.View).
Some elements cannot be hidden directly. Examples include: group, array, constraint, edit cut profile, face splitter and link to external documents.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the set of elements to be hidden is empty or one of the elements can not be hidden.
Also thrown when the set of elements to be hidden includes the view itself.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when document regeneration failed.